//Для каждого а от 1 до 3 с шагом 0.25 при всех b от 0.5 до 0.9 вычислить
//С = ах ^ 2 + bx + 0.16 / √a + b + x ^ 2  причем, если с > 0 то b = 0.1, иначе b = 0.05
#include <iostream>
#include <iomanip>
#include <cmath>
using namespace std;

int main()
{
	setlocale(0, "");
	float a, b, c, x;
	cout << "Введите значение x = ";
	cin >> x;
	a = 1; //начальное значение "a"
	cout << "_______________________" << endl;
	cout << setw(7) << "a  |" << setw(6) << "b  |" << setw(10) << "c    |" << endl;
	cout << "------|-----|---------|" << endl;
	while (a <= 3) //цикл для "a" от 1 до 3
	{
		b = 0.5; //приводим значение "b" в изначальное состояние
		while (b <= 1) //цикл для "b" от 0.5 до 0.9
		{
			c = (a * pow(x,2) + b * x + 0.16) / (sqrt(a + b + pow(x,2))); //находим значение "C"
			cout << setw(5) << a << " |"; //выводим текущее значение "a"
			cout << setw(4) << b << " |"; //выводим текущее значение "b"
			cout << setw(8) << c << " |" << endl; //выводим текущее значение "b"
			if (c > 0) //проверяем на условие, прибавляем шаг к "b"
			{
				b = b + 0.1; 
			}
			else
			{
				b = b + 0.05;
			}
		}
	a = a + 0.25; //прибавляем шаг к "a"
	} 
	cout << "______|_____|_________|" << endl;
	system("pause");
	return 0;
}